Revit 2027 API
Units.GetModifiableSpecs Method
 Gets all specs for which the default FormatOptions can be modified.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ForgeTypeId> GetModifiableSpecs()
Public Shared Function GetModifiableSpecs As IList(Of ForgeTypeId)
public:
static IList<ForgeTypeId^>^ GetModifiableSpecs()
static member GetModifiableSpecs : unit -> IList<ForgeTypeId>
Return Value
IList<ForgeTypeId>
 Identifiers of the specs for which the FormatOptions can be modified.
See Also
Reference
Units Class
Autodesk.Revit.DB Namespace